# 윤년 구하기 
# 윤년은 400년에 97년정도를 윤년으로 둠
# 1년의 길이가 365일로 실제보다 0.24일 짧아서 
# 계절과 차이가 발생하게되는것때문에 윤년으로 차이를 맞춤

# 치윤법
# 연수가 4로 나누어 떨어지는 해는 윤년
# (year % 4 == 0)
# 그 중 100으로 나누어 떨어지는 해는 평년
# (year % 100 != 0)
# 다만 400으로 나누어 떨어지는 해는 다시 윤년
# (year % 400 == 0)

# -->
# (year % 4 == 0) and (year % 100 != 0) or (year % 400 == 0)
# 이 조건식이 참이면 윤년

year = int(input("윤년인지를 알고싶은 연도를 입력하세요."))

if ( (year % 4 ==0) and (year % 100 != 0) or (year % 400 == 0)) :
    print("%d 년은 윤년이 맞습니다." %year);

else :
    print("%d 년은 윤년이 아닙니다." %year);



a = 3
a += 1
a *= 2
a -= 1
print(a)



